# GetValidSymbols Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FormatOptions..::..GetValidSymbols Method
FormatOptions Class See Also
---
Gets the identifiers of all valid symbols for the unit in this FormatOptions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<ForgeTypeId> GetValidSymbols()
```

Visual Basic
---
```text
Public Function GetValidSymbols As IList(Of ForgeTypeId)
```

Visual C++
---
```text
public:
IList<ForgeTypeId^>^ GetValidSymbols()
```

# ### Return Value
Identifiers of the valid symbols.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | UseDefault is true in this FormatOptions. |

# See Also
FormatOptions Class
GetValidSymbols Overload
Autodesk.Revit.DB Namespace